In [2]:
import pandas as pd

In [3]:
url="https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv"
a=pd.read_csv(url)
a

,Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank
0,2011,FEMALE,HISPANIC,GERALDINE,13,75
1,2011,FEMALE,HISPANIC,GIA,21,67
2,2011,FEMALE,HISPANIC,GIANNA,49,42
3,2011,FEMALE,HISPANIC,GISELLE,38,51
4,2011,FEMALE,HISPANIC,GRACE,36,53
...,...,...,...,...,...,...
29459,2016,FEMALE,HISPANIC,Alayna,10,74
29460,2015,FEMALE,HISPANIC,Yaritza,12,79
29461,2015,MALE,WHITE NON HISPANIC,Mendel,42,64
29462,2016,MALE,ASIAN AND PACIFIC ISLANDER,Isaac,21,48
29463,2015,FEMALE,WHITE NON HISPANIC,Alessia,12,81

In [4]:
a['Gender'].to_frame()

       Gender
0      FEMALE
1      FEMALE
2      FEMALE
3      FEMALE
4      FEMALE
...       ...
29459  FEMALE
29460  FEMALE
29461    MALE
29462    MALE
29463  FEMALE

[29464 rows x 1 columns]

In [5]:
'$'.join(['S','A','T','H','Y','A'])

'S$A$T$H$Y$A'

In [10]:
','.join(a["Child's First Name"].str.title().drop_duplicates().sort_values())

"Aahil,Aaliyah,Aarav,Aaron,Aarya,Aaryan,Aayan,Abby,Abdiel,Abdoul,Abdoulaye,Abdul,Abdullah,Abe,Abel,Abigail,Aboubacar,Abraham,Abrar,Abrielle,Abril,Ace,Ada,Adalynn,Adam,Adan,Addison,Adelaide,Adele,Adelina,Adeline,Adelyn,Aden,Adiel,Adina,Aditya,Adonis,Adrian,Adriana,Adrianna,Adriel,Adyan,Aharon,Ahmad,Ahmed,Ahnaf,Ahron,Ahuva,Aicha,Aidan,Aiden,Aileen,Aimee,Aisha,Aissata,Aissatou,Aitana,Aiza,Aizah,Akiva,Alaia,Alaina,Alan,Alana,Alani,Alanis,Alanna,Alayna,Alba,Albert,Alberto,Aldo,Aleah,Alec,Aleena,Alejandra,Alejandro,Aleksander,Aleksandra,Alessandra,Alessandro,Alessia,Alex,Alexa,Alexander,Alexandra,Alexandria,Alexia,Alexis,Alfred,Alfredo,Ali,Alia,Aliah,Alice,Alicia,Alijah,Alina,Alisa,Alisha,Alison,Alissa,Alisson,Aliyah,Aliza,Allan,Allen,Allison,Allyson,Alma,Alondra,Alonso,Alpha,Alston,Alter,Alvin,Alyson,Alyssa,Amadou,Amaia,Amalia,Amanda,Amani,Amar'E,Amara,Amare,Amari,Amaya,Amayah,Ambar,Amber,Amberly,Ameer,Amelia,Amelie,Amia,Amina,Aminata,Amir,Amira,Amirah,Amiya,Amiyah,Amrom,Amy,Ana,Anabel,Anabella,Anabelle,Anabia,Anahi,Anais,Analia,Ananya,Anas,Anastasia,Anaya,Anayah,Anderson,Andre,Andrea,Andres,Andrew,Andy,Angel,Angela,Angelica,Angelina,Angeline,Angelique,Angelo,Angely,Angie,Angus,Anika,Anisa,Anisha,Aniya,Aniyah,Anjali,Anna,Annabel,Annabella,Annabelle,Annalise,Anne,Annie,Annika,Anson,Anthony,Anton,Antonella,Antonia,Antonio,Anya,April,Arabella,Archer,Arden,Arely,Arham,Ari,Aria,Ariadna,Ariadne,Ariah,Arian,Ariana,Arianna,Arianny,Ariel,Ariela,Ariella,Arielle,Arisha,Ariyah,Arjun,Arlette,Arlo,Armaan,Armando,Armani,Aron,Arthur,Arturo,Arvin,Arya,Aryan,Arye,Aryeh,Asher,Ashley,Ashly,Ashton,Asia,Atara,Athena,Atticus,Aubree,Aubrey,Audrey,August,Augustus,Aurora,Austin,Autumn,Ava,Avery,Avi,Aviel,Avigail,Avital,Aviva,Avraham,Avril,Avrohom,Avrum,Awa,Axel,Aya,Ayaan,Ayala,Ayan,Ayanna,Ayat,Ayden,Aydin,Ayelet,Ayesha,Ayla,Ayleen,Aylin,Azaan,Azaria,Azariah,Aziza,Baila,Bailey,Barbara,Baruch,Basya,Batsheva,Batya,Beatrice,Beatrix,Beckett,Belen,Bella,Ben,Benjamin,Bennett,Benson,Bentzion,Benzion,Berish,Berl,Bethany,Bianca,Bintou,Binyamin,Binyomin,Blake,Blessing,Blima,Blimy,Bodhi,Bonnie,Boruch,Boubacar,Bowen,Bracha,Bradley,Brady,Brandon,Brayan,Brayden,Breindy,Brenda,Brendan,Bria,Brian,Briana,Brianna,Brianny,Bridget,Briella,Brielle,Brigitte,Britney,Brittany,Brody,Brooke,Brooklyn,Brooks,Bruce,Brucha,Bruchy,Bruno,Bryan,Bryanna,Bryant,Bryce,Brynn,Bryson,Byron,Caden,Caiden,Cairo,Caitlin,Caleb,Cali,Calvin,Camden,Cameron,Camila,Camilla,Camille,Camilo,Camren,Carina,Carla,Carlos,Carly,Carmelo,Carmen,Carmine,Carolina,Caroline,Carson,Carter,Casey,Cassandra,Cassidy,Cataleya,Catalina,Catherine,Cayden,Cecelia,Cecilia,Celeste,Celia,Celine,Cesar,Chace,Chad,Chaim,Chana,Chance,Chanel,Chanie,Chany,Charles,Charlie,Charlotte,Chase,Chava,Chavy,Chaya,Chelsea,Cheskel,Chesky,Cheyenne,Chiara,Chloe,Chris,Christian,Christina,Christine,Christopher,Christy,Cindy,Claire,Clara,Clark,Claudia,Clementine,Cleo,Cody,Cole,Colette,Colin,Colton,Connie,Connor,Conor,Cooper,Cora,Corey,Cormac,Cristian,Cristina,Cristofer,Cristopher,Crosby,Crystal,Cynthia,Cyrus,Dahlia,Daisy,Dakota,Daleyza,Dalia,Dallas,Damani,Damari,Damaris,Damian,Damien,Damon,Dana,Daniel,Daniela,Daniella,Danielle,Danna,Danny,Dante,Daphne,Daria,Dariel,Darius,Darren,Darwin,Dashiell,David,Dayana,Dean,Deborah,Declan,Delilah,Denis,Denise,Denisse,Dennis,Denzel,Dereck,Derek,Derick,Derrick,Desmond,Destiny,Devin,Devon,Devora,Devorah,Diana,Diego,Dilan,Dillon,Dina,Diya,Diyora,Dominic,Dominick,Donovan,Doris,Dov,Dovid,Drew,Dulce,Duvid,Dwayne,Dylan,Ean,Eason,Eddie,Eddy,Eden,Edgar,Edison,Edith,Eduardo,Edward,Edwin,Efraim,Egypt,Eileen,Eitan,Elaine,Elan,Eleanor,Elena,Eleni,Eli,Eliam,Elian,Eliana,Elianna,Elianny,Elias,Eliel,Eliezer,Elijah,Elimelech,Elina,Eliot,Elisa,Elise,Elisheva,Eliyahu,Eliza,Elizabeth,Ella,Elle,Elliana,Ellie,Elliot,Elliott,Ellis,Elodie,Eloise,Elsa,Eluzer,Elvin,Elvis,Elya,Emaan,Emani,Emanuel,Emely,Emerson,Emery,Emil,Emilia,Emiliano,Emilio,Emily,Emma,Emmanuel,Emmeline,Emmett,Empress,Enrique,Enzo,Ephraim,Eric,Erica,Erick,Erik,Erika,Erin,Eshaal,Eshal,Eshan,Esme,Esmeralda,Essence,Esteban,Estelle,Ester,Esther,Estrella,Esty,Ethan,Etty,Eunice,Eva,Evan,Evangeline,Eve,Evelina,Evelyn,Everett,Everly,Evie,Eyad,Ezekiel,Ezequiel,Ezra,Ezriel,Fabian,Faiga,Faigy,Faith,Fanta,Farah,Farhan,Farida,Fatima,Fatou,Fatoumata,Felipe,Felix,Fernanda,Fernando,Feynman,Filip,Finley,Finn,Fiona,Fishel,Fradel,Frady,Fraidy,Frances,Francesca,Francesco,Francis,Francisco,Frank,Franklin,Freddy,Frederick,Freida,Freya,Frieda,Frimet,Gabriel,Gabriela,Gabriella,Gabrielle,Gael,Gaia,Galilea,Gary,Gavin,Gavriel,Gemma,Genesis,Genevieve,George,Georgia,Geraldine,Gerard,Gerardo,Gia,Giada,Giancarlo,Gianluca,Gianna,Gianni,Gideon,Giovani,Giovanna,Giovanni,Giovanny,Giselle,Gittel,Gitty,Giulia,Giuliana,Giuseppe,Golda,Goldie,Goldy,Gordon,Grace,Graham,Grant,Grayson,Gregory,Greta,Greyson,Griffin,Guadalupe,Gustavo,Guy,Gwendolyn,Hadassa,Hadassah,Hadley,Hafsa,Hailey,Hailie,Haley,Hamza,Hana,Haniya,Hanley,Hanna,Hannah,Hao,Hareem,Harley,Harlow,Harmony,Harper,Harrison,Harry,Harvey,Hashim,Hassan,Hawa,Hayden,Haylee,Hayley,Hazel,Heaven,Hector,Heidi,Heidy,Helen,Helena,Henchy,Henny,Henry,Herman,Hersh,Hershel,Hershy,Hillel,Hinda,Hindy,Hoorain,Hope,Hudson,Hugo,Hunter,Ian,Ibrahim,Ibrahima,Idy,Iker,Ilan,Ilana,Imani,Imogen,Imran,Inaaya,Inaya,Ines,Ingrid,Irene,Iris,Isaac,Isabel,Isabela,Isabella,Isabelle,Isaiah,Isaias,Ishaan,Ishmael,Isiah,Isis,Isla,Ismael,Israel,Issac,Itzel,Ivan,Ivanna,Ivy,Izabella,Izaiah,Jabari,Jace,Jack,Jackson,Jacky,Jacob,Jacqueline,Jad,Jada,Jade,Jaden,Jadiel,Jael,Jaelyn,Jaelynn,Jaheim,Jahir,Jahmir,Jaiden,Jaime,Jair,Jake,Jakub,Jalen,Jaliyah,Jamal,Jamar,Jamari,Jamel,James,Jameson,Jamie,Jamir,Jana,Janae,Jane,Janelle,Janice,Janiel,Janiya,Janiyah,Jannat,Jannatul,Januel,Jared,Jariel,Jasiah,Jaslene,Jasmin,Jasmina,Jasmine,Jason,Jasper,Javier,Jax,Jaxon,Jaxson,Jay,Jayce,Jayceon,Jaycob,Jayda,Jayden,Jayla,Jaylah,Jaylee,Jayleen,Jaylen,Jaylene,Jaylin,Jaylyn,Jayren,Jayson,Jazlyn,Jazmin,Jazmine,Jazzlyn,Jean,Jeancarlos,Jefferson,Jeffrey,Jelani,Jencarlos,Jenna,Jennifer,Jenny,Jeremiah,Jeremias,Jeremy,Jermaine,Jerry,Jesse,Jessica,Jessie,Jesus,Jia,Jimena,Jimmy,Joanna,Joaquin,Jocelyn,Joel,Johan,Johann,Johanna,John,Johnathan,Johnny,Jolie,Jolin,Jonael,Jonah,Jonas,Jonathan,Jordan,Jordi,Jordyn,Jorge,Jose,Josef,Joselyn,Joseph,Josephine,Joshua,Josiah,Josie,Josue,Journee,Journey,Joy,Joyce,Joziah,Juan,Judah,Jude,Judy,Julia,Julian,Juliana,Julianna,Julie,Julien,Juliet,Juliette,Julio,Julissa,Julius,Jun,June,Junior,Juniper,Justice,Justin,Kabir,Kacper,Kaden,Kadiatou,Kaelyn,Kai,Kaia,Kaiden,Kailee,Kailey,Kailyn,Kaitlyn,Kaleb,Kali,Kaliyah,Kamari,Kameron,Kamila,Kamiyah,Kamren,Karas,Kareem,Karen,Karina,Karla,Karter,Kassandra,Kate,Katelyn,Katelynn,Katerina,Katherine,Kathryn,Katie,Kaya,Kayden,Kayla,Kaylani,Kaylee,Kayleen,Kayleigh,Kaylie,Kaylin,Kayson,Kazi,Kehlani,Keila,Keily,Keira,Keith,Kelly,Kelsey,Kelvin,Kendra,Kendrick,Kennedi,Kennedy,Kenneth,Kenny,Kenya,Kevin,Keyla,Khadija,Khadijah,Khaleesi,Khalil,Khloe,Kian,Kiara,Kiera,Kieran,Kimberly,Kimi,Kimora,King,Kingsley,Kingston,Kira,Kiyan,Kori,Kourtney,Krish,Kristen,Kristian,Kristina,Krystal,Kyla,Kyle,Kylee,Kylie,Kymani,Kyree,Kyrie,Kyson,Laila,Lailah,Laith,Lamar,Lana,Landon,Lara,Larry,Laura,Lauren,Lauryn,Lawrence,Layan,Layla,Lazer,Lea,Leah,Leandro,Leanna,Leela,Legend,Leia,Leibish,Leila,Leilani,Leilany,Lena,Lenny,Leo,Leon,Leona,Leonard,Leonardo,Leonel,Leonidas,Leora,Lesley,Leslie,Lesly,Lev,Levi,Leyla,Lia,Liam,Lian,Liana,Liba,Libby,Lielle,Lila,Lilah,Lilia,Lilian,Liliana,Lillian,Lilliana,Lilly,Lily,Lina,Lincoln,Linda,Lindsay,Lionel,Liora,Lipa,Lisa,Litzy,Liv,Livia,Liz,Lizbeth,Lizeth,Logan,Lola,London,Londyn,Lorenzo,Louis,Louisa,Louise,Luca,Lucas,Lucia,Lucian,Luciana,Lucien,Lucille,Lucy,Luis,Luka,Lukas,Luke,Luna,Luz,Lydia,Lyla,Lyric,Mabel,Mackenzie,Maddox,Madeleine,Madeline,Madelyn,Madina,Madison,Madisyn,Mae,Maeve,Magaly,Maggie,Mahamadou,Mahnoor,Maia,Maimouna,Maisie,Maison,Maite,Major,Makai,Makayla,Makenzie,Makhi,Maksim,Malachi,Malak,Malaysia,Malcolm,Malek,Malia,Maliha,Malik,Malika,Maliyah,Malka,Malky,Mamadou,Mandy,Manha,Manuel,Marc,Marcel,Marcelo,Marco,Marcos,Marcus,Margaret,Margaux,Margot,Maria,Mariah,Mariam,Mariama,Mariana,Marie,Marielle,Marilyn,Marina,Mario,Marisol,Marjorie,Mark,Marley,Marlon,Marlowe,Marquis,Martin,Marvin,Mary,Maryam,Mason,Massimo,Mateo,Mathew,Mathias,Matias,Matilda,Matteo,Matthew,Matthias,Maurice,Mauricio,Maverick,Max,Maxim,Maximilian,Maximiliano,Maximo,Maximus,Maxwell,Maya,Mayer,Mayson,Mckenzie,Md,Mechel,Meera,Megan,Meilech,Meir,Mekhi,Melania,Melanie,Melany,Melina,Melissa,Melody,Melvin,Menachem,Menashe,Mendel,Mendy,Menucha,Meshilem,Messiah,Meyer,Mia,Miah,Micah,Michael,Michaela,Michal,Michelle,Miguel,Mika,Mikael,Mikaela,Mikayla,Mike,Mila,Milagros,Milan,Milana,Milani,Milania,Milena,Miles,Miley,Millie,Milo,Mina,Mindy,Mira,Miracle,Miranda,Mirel,Miri,Miriam,Misael,Mohamed,Mohammad,Mohammed,Moises,Moishe,Molly,Monica,Monserrat,Montserrat,Mordche,Mordechai,Morgan,Morris,Moses,Moshe,Motty,Mouhamed,Moussa,Muhammad,Musa,Mushka,Mustafa,Mya,Myles,Myra,Nabiha,Nachman,Nadia,Naftali,Naftuli,Nahla,Nala,Nalani,Nana,Nancy,Naomi,Nashla,Nashley,Nashly,Nasir,Natalia,Natalie,Nataly,Natasha,Nathalia,Nathalie,Nathaly,Nathan,Nathanael,Nathaniel,Nava,Nayeli,Nayla,Nazir,Nechama,Nehemiah,Neil,Nelson,Nevaeh,Neymar,Nia,Niam,Nicholas,Nico,Nicolas,Nicole,Nicolette,Nigel,Nikhil,Nikita,Nikolai,Nikolas,Nina,Noa,Noach,Noah,Noam,Noel,Noelle,Noemi,Nolan,Noor,Nora,Norah,Nosson,Nova,Nuchem,Nusrat,Nyah,Nyla,Nylah,Olive,Oliver,Olivia,Omar,Omari,Oren,Ori,Orion,Orlando,Oscar,Otis,Otto,Oumar,Oumou,Ousmane,Owen,Pablo,Paige,Pamela,Paola,Paris,Parker,Patrick,Paul,Paula,Payton,Pearl,Pedro,Penelope,Perel,Peretz,Perl,Perla,Perry,Pessy,Peter,Peyton,Philip,Phoebe,Phoenix,Pierce,Pinchas,Pinchus,Piper,Polina,Poppy,Precious,Preston,Prince,Princess,Princeton,Priscilla,Queena,Queenie,Quincy,Quinn,Rachel,Rafael,Rahaf,Raina,Raizel,Raizy,Ralph,Randy,Raphael,Raquel,Raul,Raya,Rayan,Raymond,Rayna,Rayyan,Reagan,Rebecca,Reed,Reem,Reese,Rehan,Reid,Reign,Reizy,Rena,Renata,Renee,Reuben,Reuven,Rhys,Ricardo,Richard,Ricky,Rifka,Rifky,Rihanna,Riley,Rina,Riva,River,Rivka,Rivkah,Rivky,Riya,Robert,Roberto,Rocco,Rochel,Rodney,Rodrigo,Roger,Rohan,Roiza,Roizy,Roman,Romeo,Romy,Ronald,Ronaldo,Ronan,Rory,Rosa,Rose,Roselyn,Rosemary,Rosie,Rowan,Roy,Royal,Royalty,Royce,Ruben,Ruby,Ruchel,Ruchy,Russell,Ruth,Ryan,Ryder,Rylee,Sabiha,Sabina,Sabrina,Sade,Sadie,Safa,Safwan,Sage,Saifan,Saige,Salma,Salome,Salvatore,Sam,Sama,Samaira,Samantha,Samara,Sami,Samir,Samira,Samiya,Samiyah,Samuel,Sanaa,Sanai,Sandra,Saniya,Saniyah,Santiago,Santino,Saoirse,Sara,Sarah,Sarahi,Sarai,Sari,Sariah,Sarina,Sariyah,Sasha,Saul,Savanna,Savannah,Savion,Sawyer,Scarlet,Scarlett,Sean,Sebastian,Sekou,Selena,Selim,Selina,Selma,Serena,Serenity,Sergio,Seth,Sevyn,Shaina,Shaindel,Shaindy,Shalom,Shane,Shania,Shaniya,Sharon,Shaul,Shawn,Shaya,Shayaan,Shayan,Shayla,Shayna,Shea,Sheldon,Sherlyn,Sherry,Shevy,Shia,Shifra,Shiloh,Shimon,Shira,Shirley,Shloime,Shloimy,Shloma,Shlome,Shlomo,Shmiel,Shmuel,Shneur,Sholom,Shoshana,Shraga,Shreya,Shulem,Sidney,Siena,Sienna,Silas,Sima,Simcha,Simi,Simon,Simone,Sincere,Sky,Skye,Skyla,Skylah,Skylar,Skyler,Sloane,Sofia,Solomon,Sonia,Sophia,Sophie,Soraya,Spencer,Stacey,Stacy,Stanley,Stella,Stephanie,Stephany,Stephen,Steve,Steven,Subhan,Sulaiman,Summer,Sunny,Suri,Sury,Sydney,Syed,Syeda,Sylvia,Sylvie,Symphony,Tabitha,Tahmid,Talia,Taliyah,Tamar,Tamara,Tamia,Tanisha,Taraji,Tasnim,Tatiana,Taylor,Teagan,Tehila,Tenzin,Terrell,Terrence,Terry,Tess,Tessa,Thea,Theo,Theodora,Theodore,Thiago,Thomas,Tiana,Tianna,Tiffany,Timothy,Timur,Tina,Toba,Tobias,Toby,Tomas,Tony,Tori,Tova,Trany,Travis,Trinity,Tristan,Troy,Tyler,Tzipora,Tziporah,Tzippy,Tzirel,Tzivia,Tzvi,Umar,Uriel,Usher,Valentina,Valentino,Valeria,Valerie,Valery,Vanessa,Veer,Vera,Veronica,Veronika,Vicky,Victor,Victoria,Vienna,Vihaan,Vincent,Vincenzo,Violet,Violeta,Virginia,Vivian,Viviana,Vivienne,Walker,Walter,Wendy,Wesley,Weston,Willa,William,Willow,Wilson,Winnie,Winston,Winter,Wolf,Wyatt,Wynter,Xander,Xavier,Ximena,Xin,Yaakov,Yachet,Yadiel,Yael,Yahir,Yahya,Yair,Yakov,Yamilet,Yamileth,Yandel,Yaniel,Yanky,Yara,Yaretzi,Yariel,Yaritza,Yaseen,Yasmin,Yasmina,Yasmine,Yassin,Yechezkel,Yechiel,Yehoshua,Yehuda,Yehudah,Yehudis,Yerik,Yesenia,Yeshaya,Yida,Yidel,Yides,Yisrael,Yisroel,Yitta,Yitty,Yitzchak,Yitzchok,Yocheved,Yoel,Yona,Yonah,Yonatan,Yosef,Yossi,Yousef,Youssef,Yu,Yuna,Yusuf,Zabdiel,Zachariah,Zachary,Zahara,Zahir,Zahra,Zaiden,Zain,Zainab,Zaire,Zakaria,Zalmen,Zamir,Zander,Zane,Zaniyah,Zara,Zaria,Zariah,Zayan,Zayden,Zayn,Zelda,Zendaya,Zev,Zion,Zissy,Zoe,Zoey,Zoya,Zuri,Zyaire"

In [6]:
a.to_csv('Just_for_fun',index=False,columns=['Gender','Ethnicity','Count'])

In [10]:
b=pd.read_excel('Book1.xlsx')

In [12]:
b

   commdity code  price per unit  no ofunits sold   sales  Unnamed: 4
0            1.0            1205               50   60250       45555
1            2.0            6570               60  394200        5666
2            3.0            8225               50  411250       78888
3            4.0            4505               90  405450       99999
4            NaN               4          1271150  799650       45560

In [15]:
great3=b[b['commdity code']>=3]

In [22]:
less3=b[b['commdity code']<3]

In [19]:
xfile=pd.ExcelWriter('just_fun.xlsx',encoding='utf-8')

In [20]:
great3.to_excel(xfile,sheet_name='onnu',encoding='utf-8')

In [23]:
less3.to_excel(xfile,sheet_name='randu',encoding='utf-8')

In [24]:
xfile.save()

In [25]:
b.to_excel("XLfile.xlsx",sheet_name="onnu")

In [20]:
sal=pd.read_csv('Salaries.csv')

c:\python\python392\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [21]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [5]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [16]:
sal['TotalPay'].mean()

74768.32197169267

In [22]:
sal['TotalPayBenefits'].max()

567595.43

In [26]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [28]:
#how much does joseph driscoll make
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPay']

24    270324.91
Name: TotalPay, dtype: float64

In [36]:
# name of person who gets max salary
sal[sal['TotalPay']==sal['TotalPay'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [44]:
sal.loc[sal['TotalPayBenefits'].idxmax()]

Id                                                               1
EmployeeName                                        NATHANIEL FORD
JobTitle            GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
BasePay                                                  167411.18
OvertimePay                                                    0.0
OtherPay                                                 400184.25
Benefits                                                       NaN
TotalPay                                                 567595.43
TotalPayBenefits                                         567595.43
Year                                                          2011
Notes                                                          NaN
Agency                                               San Francisco
Status                                                         NaN
Name: 0, dtype: object

In [46]:
sal.loc[sal['TotalPayBenefits'].argmax()]

Id                                                               1
EmployeeName                                        NATHANIEL FORD
JobTitle            GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
BasePay                                                  167411.18
OvertimePay                                                    0.0
OtherPay                                                 400184.25
Benefits                                                       NaN
TotalPay                                                 567595.43
TotalPayBenefits                                         567595.43
Year                                                          2011
Notes                                                          NaN
Agency                                               San Francisco
Status                                                         NaN
Name: 0, dtype: object

In [42]:
# name of lowest paid person
sal[sal['TotalPay']==sal['TotalPay'].min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

In [51]:
sal.loc[sal['TotalPay'].idxmin()]

148653

In [53]:
sal.iloc[sal['TotalPay'].argmin()]

Id                                      148654
EmployeeName                         Joe Lopez
JobTitle            Counselor, Log Cabin Ranch
BasePay                                   0.00
OvertimePay                               0.00
OtherPay                               -618.13
Benefits                                  0.00
TotalPay                               -618.13
TotalPayBenefits                       -618.13
Year                                      2014
Notes                                      NaN
Agency                           San Francisco
Status                                      PT
Name: 148653, dtype: object

In [54]:
sal

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [62]:
#mean totalpay of all employees per year
sal.groupby('Year').mean()['TotalPay']

Year
2011    71744.103871
2012    74113.262265
2013    77611.443142
2014    75463.918140
Name: TotalPay, dtype: float64

In [66]:
#  unique job titles
sal['JobTitle'].unique()
#no of unique job titles
sal['JobTitle'].nunique()

2159

In [68]:
len(sal['JobTitle'].unique())

2159

In [76]:
# top 5 most common jobs
sal['JobTitle'].value_counts().head()

2014    38123
2013    37606
2012    36766
2011    36159
Name: Year, dtype: int64

In [85]:
#no of job titles represented by only one person in 2013
#sal[sal['Year']==2013]  grabbing the year 2013
#sal[sal['Year']==2013]['JobTitle'] grabbing job title
sum(sal[sal['Year']==2013]['JobTitle'].value_counts()==1)

202

In [87]:
# how many people have the word chief in job title
def chief_string(title):
    if 'chief' in title.lower().split():
        return True
    else:
        return False

In [88]:
sal['JobTitle'].iloc[0]

'GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY'

In [89]:
chief_string('GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY')

False

In [90]:
chief_string(' CHIEF GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY')

True

In [95]:
#so
sum(sal['JobTitle'].apply(lambda x: chief_string(x)))

477

In [100]:
# is ther a correlation btwn length of job title string and salary
sal['Title_len']=sal['JobTitle'].apply(len)

In [102]:
sal[['JobTitle','Title_len']]

                                              JobTitle  Title_len
0       GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY         46
1                      CAPTAIN III (POLICE DEPARTMENT)         31
2                      CAPTAIN III (POLICE DEPARTMENT)         31
3                 WIRE ROPE CABLE MAINTENANCE MECHANIC         36
4         DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)         44
...                                                ...        ...
148649                                       Custodian          9
148650                                    Not provided         12
148651                                    Not provided         12
148652                                    Not provided         12
148653                      Counselor, Log Cabin Ranch         26

[148654 rows x 2 columns]

In [103]:
sal[['JobTitle','Title_len']].corr()

           Title_len
Title_len        1.0

In [104]:
sal[['TotalPay','Title_len']].corr()

           TotalPay  Title_len
TotalPay   1.000000  -0.015356
Title_len -0.015356   1.000000